Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Only allow all origins in the development profile (`%dev`). Allowing unrestricted origins in production environments poses severe security risks, such as unauthorized data access or resource abuse. For production, define explicit origins in the `quarkus.http.cors.origins` property.
ja_jp: 開発プロファイル (`%dev`) では、すべてのオリジンを許可できます。 ただし、実稼働環境でオリジンを無制限に許可すると、不正なデータアクセスやリソースの不正利用など、深刻なセキュリティリスクを引き起こす可能性があります。 実稼働環境では、`quarkus.http.cors.origins` プロパティーで明示的に許可するオリジンを定義してください。

source: Only apply the transformation if the class is `org.acme.Bar`.
ja_jp: クラスが `org.acme.Bar` の場合にのみ変換を適用します。

source: Only invoke the login challenge and authenticator
ja_jp: ログインチャレンジと認証デバイスのみを呼出

source: Only invoke the registration challenge and authenticator
ja_jp: 登録チャレンジと認証デバイスのみを呼出

source: Only keep ``MessageTransformer``s
ja_jp: `MessageTransformer` のみを保持

source: Only keep classes from the root package we target
ja_jp: 対象のルートパッケージのクラスのみを保持

source: Only method can be annotated with `@Blocking` can use `@RunOnVirtualThreads`. The eligible method signatures are:
ja_jp: `@Blocking` でアノテーションを付けることができるメソッドのみが `@RunOnVirtualThreads` を使用できます。 適格なメソッドシグネチャーは次のとおりです。

source: Only one Funqy function can be exported per AWS Lambda deployment. If you have multiple functions defined within your project, then you will need to choose the function within your Quarkus `application.properties`:
ja_jp: AWS Lambdaデプロイメントごとにエクスポートできる Funqy 関数は 1 つだけです。プロジェクト内で複数の関数を定義している場合は、Quarkus `application.properties` 内で関数を選択する必要があります。

source: Only one Funqy function can be exported per Amazon Lambda deployment. If you have multiple functions defined within your project, then you will need to choose the function within your Quarkus `application.properties`:
ja_jp: Amazon LambdaデプロイメントごとにエクスポートできるFunqy関数は1つだけです。プロジェクト内で複数の関数を定義している場合は、Quarkus `application.properties` 内で関数を選択する必要があります .

source: Only one Funqy function can be exported per Google Cloud Functions deployment. If you only have one method annotated with `@Funq` in your project, then there is no worries. If you have multiple functions defined within your project, then you will need to choose the function within your Quarkus `application.properties`:
ja_jp: Google Cloud Functions のデプロイごとにエクスポートできる Funqy 関数は 1 つだけです。プロジェクト内に `@Funq` でアノテーションされたメソッドが 1 つしかない場合は、心配ありません。プロジェクト内に複数の関数が定義されている場合は、Quarkus `application.properties` 内で関数を選択する必要があります。

source: Only one offering can be configured per registry at this point.
ja_jp: 現時点では、レジストリーごとに1つのオファリングのみを設定できます。

source: Only override what's necessary:
ja_jp: 必要な項目のみをオーバーライドします。

source: Only requests with OpenID Connect scope `email` will be granted access.
ja_jp: OpenID Connect スコープ `email` を持つリクエストのみにアクセスが許可されます。

source: Only some endpoints need to include all methods. However, it must contain at least `@On[Text|Binary]Message` or `@OnOpen`.
ja_jp: 一部のエンドポイントのみにすべてのメソッドを含める必要があります。 ただし、少なくとも `@On[Text|Binary]Message` または `@OnOpen` が含まれている必要があります。

source: Only text based media types are supported at the moment as Azure Functions HTTP Trigger for Java does not support a binary format
ja_jp: Azure Functions HTTP Trigger for Javaがバイナリ形式をサポートしていないため、現時点ではテキストベースのメディアタイプのみがサポートされています

source: Only the @ExceptionHandler capability is supported
ja_jp: サポートされているのは@ExceptionHandler機能のみです

source: Only the Mutiny client can be _mocked_, channels, and other stubs cannot be mocked.
ja_jp: _モック_ できるのはMutinyクライアントのみで、チャンネルや、その他のスタブはモックできません。

source: Only the `List` mapping can maintain element order. Hence, with `Set` mappings the element order is not maintained from the configuration files but is random.
ja_jp: 要素の順序を維持できるのは `List` マッピングだけです。したがって、 `Set` マッピングでは、要素の順番は設定ファイルから維持されず、ランダムになります。

source: Only the `exposed`, `path` and `collectionResourceRel` annotation properties are supported.
ja_jp: `exposed`, `path`, `collectionResourceRel` のアノテーションプロパティにのみ対応しています。

source: Only the `javax.\*` packages from Jakarta EE have changed. The ones from the JDK are still under `javax.*`.
ja_jp: Jakarta EE の `javax.\*` パッケージだけが変更されています。JDKからのものは、まだ `javax.*` のままです。

source: Only the default tenant configuration applies when controlling anonymous access to the public resource is required.
ja_jp: パブリックリソースへの匿名アクセスを制御する必要がある場合、デフォルトのテナント設定のみが適用されます。

source: Only the first producer will get the `@Default` qualifier, the second will not. Hence, there will be no error, and everything will work as expected.
ja_jp: 最初のプロデューサーのみが `@Default` 修飾子を取得し、2 番目のプロデューサーは取得しません。したがって、エラーは発生せず、すべてが期待どおりに動作します。

source: Only the optional dependency corresponding to the JDBC driver of PostgreSQL is expected in the final artifact.
ja_jp: PostgreSQLのJDBCドライバに対応するオプションの依存関係のみが、最終的な成果物として期待されます。

source: Only the repository methods listed above are supported. No other standard or custom methods are supported.
ja_jp: 上記のリポジトリメソッドのみがサポートされています。その他の標準的なメソッドやカスタムメソッドはサポートされていません。

source: Only use `org.acme` as package name.
ja_jp: パッケージ名には `org.acme` のみを使用してください。

source: Only use the `Log` API in application classes, not in external dependencies. `Log` method calls that are not processed by Quarkus at build time will throw an exception.
ja_jp: `Log` APIはアプリケーションクラスでのみ使用し、外部の依存関係では使用しないでください。ビルド時にQuarkusによって処理されていない `Log` メソッド呼び出しは、例外が発生します。

source: Only users with the `admin` role can access the `http://localhost:8080/api/admin` endpoint. If you try to access this endpoint with the previously-issued access token, you get a `403` response from the server.
ja_jp: `admin` ロールを持つユーザーのみが `http://localhost:8080/api/admin` エンドポイントにアクセスできます。 以前に発行されたアクセストークンを使用してこのエンドポイントにアクセスしようとすると、サーバーから `403` レスポンスが返されます。

source: Only with the Undertow extension; see xref:cdi.adoc#bean-scope-available[here] for details
ja_jp: Undertow エクステンションのみ。詳細は xref:cdi.adoc#bean-scope-available[こちら] を参照してください。

source: Onwards!
ja_jp: さらなる高みへ！

source: Open <code>src/main/java/org/acme/GreetingResource.java</code> in a text editor or your <a href="https://quarkus.io/guides/ide-tooling">favorite IDE</a> and change "Hello from RESTEasy Reactive" to "Hola from RESTEasy Reactive". Then refresh the browser and see the changes.
ja_jp: テキストエディターまたは<a href="https://quarkus.io/guides/ide-tooling">お気に入りの IDE</a> で <code>src/main/java/org/acme/GreetingResource.java</code> を開き、「Hello from RESTEasy Reactive」を「Hola from RESTEasy Reactive」に変更します。その後、ブラウザーを更新して変更を確認してください。

source: Open JFR dump file
ja_jp: JFR ダンプファイルを開く

source: Open `http://localhost:8080/prices.html` in your browser.
ja_jp: ブラウザーで `http://localhost:8080/prices.html` を開いてください。

source: Open `http://localhost:8080/quotes.html` in your browser and request some quotes by clicking the button.
ja_jp: `http://localhost:8080/quotes.html` をブラウザで開き、ボタンをクリックして見積を依頼してください。

source: Open `src/main/resources/application.properties` and add the following line:
ja_jp: `src/main/resources/application.properties` を開いて、以下の行を追加します:

source: Open a GitHub issue: https://github.com/redhat-developer/vscode-quarkus/issues/new
ja_jp: GitHubの課題の作成: https://github.com/redhat-developer/vscode-quarkus/issues/new

source: Open a browser and navigate to http://my-service.127.0.0.1.nip.io/api.
ja_jp: ブラウザーを開き、 http://my-service.127.0.0.1.nip.io/api に移動します。

source: Open a browser to http://localhost:8080/legumes.html and you will see our list of legumes.
ja_jp: ブラウザを開いて http://localhost:8080/legumes.html にアクセスすると、マメ科植物のリストが表示されます。

source: Open a browser to http://localhost:8080/legumes.html, and you will see our list of legumes.
ja_jp: ブラウザーを開いて http://localhost:8080/legumes.html にアクセスすると、マメ科植物のリストが表示されます。

source: Open a browser, access http://localhost:8080/hello and get the name displayed in the browser.
ja_jp: ブラウザーを開いて http://localhost:8080/hello にアクセスし、ブラウザーに表示される名前を取得します。

source: Open a browser, access http://localhost:8080/hello and get your name displayed in the browser.
ja_jp: ブラウザーを開いて http://localhost:8080/hello にアクセスし、ブラウザーに自分の名前を表示します。

source: Open a separate terminal. You'll first need to learn the URL of the broker. Execute this command to find it.
ja_jp: 別の端末を開きます。まずブローカーのURLを知る必要があります。このコマンドを実行して探します。

source: Open a xref:dev-ui.adoc[Dev UI] available at http://localhost:8080/q/dev-ui[/q/dev-ui] and click a **Provider: Keycloak** link on an **OpenID Connect** card in the Dev UI.
ja_jp: http://localhost:8080/q/dev-ui[/q/dev-ui] で入手可能な xref:dev-ui.adoc[Dev UI] を開き、Dev UI の **OpenID Connect** カードの **Provider: Keycloak** リンクをクリックします。

source: Open a xref:dev-ui.adoc[Dev UI] available at http://localhost:8080/q/dev-ui[/q/dev-ui] and click a `Keycloak provider` link in the *OpenID Connect Dev UI* card.
ja_jp: http://localhost:8080/q/dev-ui[/q/dev-ui] で入手可能な xref:dev-ui.adoc[Dev UI] を開き、*OpenID Connect Dev UI* カードの `Keycloak provider` リンクをクリックします。

source: Open a xref:dev-ui.adoc[Dev UI] available at http://localhost:8080/q/dev-v1[/q/dev-v1] and click on a `Provider: Keycloak` link in an `OpenID Connect` `Dev UI` card.
ja_jp: link:http://localhost:8080/q/dev-v1[q/dev-v1] で利用できる xref:dev-ui.adoc[Dev UI] を開き、 `OpenID Connect` `Dev UI` カードの `Provider: Keycloak` リンクをクリックします。

source: Open a xref:dev-ui.adoc[Dev UI] available at http://localhost:8080/q/dev[/q/dev] and click on a `Provider: Keycloak` link in an `OpenID Connect` `Dev UI` card.
ja_jp: http://localhost:8080/q/dev[/q/dev] で入手可能な xref:dev-ui.adoc[Dev UI] を開き、 `OpenID Connect` `Dev UI` の `Provider: Keycloak` リンクをクリックします。

source: Open a xref:dev-ui.adoc[Dev UI], which you can find at http://localhost:8080/q/dev-ui[/q/dev-ui]. Then, in an `OpenID Connect` card, click the `Keycloak provider` link .
ja_jp: http://localhost:8080/q/dev-ui[/q/dev-ui] にある xref:dev-ui.adoc[Dev UI] を開きます。 次に、`OpenID Connect` カードで、 `Keycloak provider` リンクをクリックします。

source: Open an issue: https://github.com/redhat-developer/intellij-quarkus/issues
ja_jp: Issueを開く: https://github.com/redhat-developer/intellij-quarkus/issues

source: Open another terminal and run the `curl http://localhost:8080/increments` command.
ja_jp: 別のターミナルを開いて `curl http://localhost:8080/increments` コマンドを実行します。

source: Open blocks (`--`) are not supported in the AsciiDoc documentation. All the other types of blocks (source, admonitions...) are supported.
ja_jp: オープンブロック( `--` )は、AsciiDocドキュメントではサポートされていません。他のタイプのブロック（source, admonitions...）はすべてサポートされています。

source: Open http://localhost:8080/fruits to invoke this method:
ja_jp: http://localhost:8080/fruits を開いて、このメソッドを呼び出します。

source: Open http://localhost:8080/hello, authenticate to Auth0 and get `403`. The reason you get `403` is because Quarkus OIDC does not know which claim in the `Auth0` tokens represents the roles information, by default a `groups` claim is checked, while Auth0 tokens are now expected to have an "https://quarkus-security.com/roles" claim.
ja_jp: http://localhost:8080/hello を開き、Auth0 に対して認証すると `403` が発生します。ここでは、Quarkus OIDC が `Auth0` トークンのどのクレームがロール情報を表しているか認識していないため、 `403` が発生します。デフォルトでは `groups` クレームがチェックされますが、ここでは Auth0 トークンに "https://quarkus-security.com/roles" クレームがあることが期待されます。

source: Open http://localhost:8080/q/dev/ in a browser session. An OpenId Connect card that links to an Auth0 provider SPA displays, as follows:
ja_jp: ブラウザーセッションで http://localhost:8080/q/dev/ を開きます。以下のように、Auth0 プロバイダー SPA にリンクする OpenId Connect カードが表示されます：

source: Open src/main/resources/application.properties and add the following line to enable SSL in your native image.
ja_jp: src/main/resources/application.properties を開き、以下の行を追加してネイティブイメージでSSLを有効にします。

source: Open the **Dev UI** settings dialog and select the Dev MCP tab. There you can enable Dev MCP, get the connection details (Default `http://localhost:8080/q/dev-mcp`) and see what clients are connected.
ja_jp: **Dev UI** の設定ダイアログを開き、Dev MCP タブを選択します。そこで Dev MCP を有効にし、接続の詳細 (デフォルトは `http://localhost:8080/q/dev-mcp`) を取得して、どのクライアントが接続されているかを確認できます。

source: Open the Dev UI by using HTTPS: `https://localhost:8443/q/dev` or by issuing a `curl` request:
ja_jp: HTTPS (`https://localhost:8443/q/dev`) を使用するか、`curl` リクエストを発行して Dev UI を開きます。

source: Open the `Author` class and include the content below.
ja_jp: `Author` クラスを開き、以下の内容を記載します。

source: Open the `Book` class and include the content below.
ja_jp: `Book` クラスを開き、以下の内容を含めます。

source: Open the `application.properties` file in the `src/main/resources` directory with any text editor.
ja_jp: `src/main/resources` ディレクトリの `application.properties` をテキストエディタで開いて下さい。

source: Open the `pom.xml` file, and set the Java version to {jdk-version-latest}:
ja_jp: `pom.xml` 、Javaのバージョンを{jdk-version-latest}に設定します:

source: Open the `pom.xml` file, and set the Java version to {jdk-version-other}:
ja_jp: `pom.xml` を開き、Javaのバージョンを {jdk-version-other} に設定してください：

source: Open the `pom.xml` file, and set the Java version.
ja_jp: `pom.xml` ファイルを開き、Java バージョンを設定します。

source: Open the `src/main/java/org/acme/rest/client/ExtensionsResource.java` file and update it with the following content:
ja_jp: `src/main/java/org/acme/rest/client/ExtensionsResource.java` ファイルを開き、以下の内容で更新してください。

source: Open the browser and access http://localhost:8080/hello.
ja_jp: ブラウザーを開き、 http://localhost:8080/hello にアクセスします。

source: Open the existing `org.acme.ExampleResource` class, and edit the content to become:
ja_jp: 既存の `org.acme.ExampleResource` クラスを開き、内容を編集してこのようになります。

source: Open the file `src/main/java/org/acme/GreetingResource.java` in an editor and annotate the `hello` method with an @LRA annotation (also inject the LRA context into the method using the JAX-RS `javax.ws.rs.HeaderParam` annotation). In addition, add two callback methods which will be called when the LRA is closed or cancelled.
ja_jp: ファイル `src/main/java/org/acme/GreetingResource.java` をエディタで開き、 `hello` メソッドに @LRA アノテーションを付けます（また、JAX-RS `javax.ws.rs.HeaderParam` アノテーションを使用して、LRA コンテキストをメソッドに注入します）。さらに、LRAが閉じられたときやキャンセルされたときに呼び出される2つのコールバックメソッドを追加します。

source: Open the generated project in your IDE. In a terminal, navigate to the project and start your application in dev mode:
ja_jp: 生成されたプロジェクトをIDEで開いてください。ターミナルでプロジェクトに移動し、devモードでアプリケーションを起動します：

source: Open the project directory in VS Code. If you have installed the Java Extension Pack (grouping a set of Java extensions), the project is loaded as a Gradle project.
ja_jp: VS Codeでプロジェクトディレクトリーを開きます。Java Extension Pack(Javaエクステンションのセットをグループ化したもの)をインストールしている場合、プロジェクトはGradleプロジェクトとして読み込まれます。

source: Open the project directory in VS Code. If you have installed the Java Extension Pack (grouping a set of Java extensions), the project is loaded as a Maven project.
ja_jp: VS Codeでプロジェクトディレクトリーを開きます。Java Extension Pack (Javaエクステンションのセットをグループ化したもの) をインストールしている場合、プロジェクトは Maven プロジェクトとしてロードされます。

source: Open the two projects in your favorite IDE.
ja_jp: 2つのプロジェクトをお好みのIDEで開きます。

source: Open the xref:dev-ui.adoc[Dev UI]
ja_jp: xref:dev-ui.adoc[Dev UI] を開く

source: Open the xref:dev-ui.adoc[Dev UI] at http://localhost:8080/q/dev-ui[/q/dev-ui].
ja_jp: xref:dev-ui.adoc[Dev UI] at http://localhost:8080/q/dev-ui[/q/dev-ui] を開きます。

source: Open your browser again to http://localhost:8080/greeting and introduce `scott` and `jb0ss` in the dialog displayed.
ja_jp: ブラウザーを http://localhost:8080/greeting で再度開いて、表示されたダイアログに `scott` と `jb0ss` を導入します。

source: Open your browser again to http://localhost:8080/greeting and let empty the dialog displayed.
ja_jp: ブラウザーを http://localhost:8080/greeting で再度開いて、表示されたダイアログを空にします。

source: Open your browser and navigate to https://localhost:8543[https://localhost:8543].
ja_jp: ブラウザーを開き、 https://localhost:8543[https://localhost:8543] に移動します。

source: Open your browser and navigate to your application `https://<your ngrok instance>.ngrok-free.app/`. Quarkus will redirect you to Slack provider on the first request where you can grant required permissions:
ja_jp: ブラウザーを開き、 `https://<your ngrok instance>.ngrok-free.app/` アプリケーションに移動します。 Quarkus は最初のリクエストで Slack プロバイダーにリダイレクトし、必要な権限を付与できます。

source: Open your browser to http://localhost:8080 to see you table again, now running from a single optimized Quarkus jar.
ja_jp: ブラウザで http://localhost:8080 を開くと、最適化された単一のQuarkus jarから実行されているテーブルが表示されます。

source: Open your browser to http://localhost:8080/extension/id/io.quarkus:quarkus-rest-client-reactive.
ja_jp: ブラウザで http://localhost:8080/extension/id/io.quarkus:quarkus-rest-client-reactive を開きます。

source: Open your browser to http://localhost:8080/extension/id/io.quarkus:quarkus-rest-client.
ja_jp: ブラウザで http://localhost:8080/extension/id/io.quarkus:quarkus-rest-client を開きます。

source: Open your browser to http://localhost:8080/greeting.
ja_jp: ブラウザで http://localhost:8080/greeting を開きます。

source: Open your favorite terminal and use JBang to install the Quarkus CLI. You do not need to have Java installed first.
ja_jp: お好みのターミナルを開き、JBang を使用して Quarkus CLI をインストールします。Java が事前にインストールされている必要はありません。

source: OpenAI (e.g., ChatGPT, Openshift AI, Podman AI Lab, ...)
ja_jp: OpenAI (ChatGPT、 Openshift AI、 Podman AI Lab など)

source: OpenAPI and Swagger worked without tweaking
ja_jp: OpenAPIとSwaggerは微調整なしで動作しました

source: OpenID Connect (OIDC) Bearer token authentication
ja_jp: OpenID Connect (OIDC) ベアラートークン認証

source: OpenID Connect (OIDC) Dev Services
ja_jp: OpenID Connect (OIDC) を使用したサービスアプリケーションの保護

source: OpenID Connect (OIDC) and OAuth2 Client and Filters Reference
ja_jp: OpenID Connect (OIDC) と OAuth2 のクライアント、フィルターリファレンス

source: OpenID Connect (OIDC) and OAuth2 Client and Filters Reference Guide
ja_jp: OpenID Connect（OIDC）およびOAuth2クライアントとフィルターリファレンスガイド

source: OpenID Connect (OIDC) and OAuth2 client and filters
ja_jp: OpenID Connect (OIDC) と OAuth2 クライアントおよびフィルター

source: OpenID Connect (OIDC) and OAuth2 dynamic client registration
ja_jp: OpenID Connect (OIDC) と OAuth2 の動的クライアント登録

source: OpenID Connect (OIDC) authorization code flow mechanism
ja_jp: OpenID Connect (OIDC) 認可コードフローメカニズム

source: OpenID Connect (OIDC) configuration properties
ja_jp: OpenID Connect (OIDC) 設定プロパティ

source: OpenID Connect (OIDC) is an identity layer that works on top of the OAuth 2.0 protocol. OIDC enables client applications to verify the identity of a user based on the authentication performed by the OIDC provider and retrieve basic information about that user.
ja_jp: OpenID Connect (OIDC) は、OAuth 2.0 プロトコル上で動作する ID レイヤーです。 OIDC は、クライアントアプリケーションが OIDC プロバイダーによって実行された認証に基づいてユーザーの身元を確認し、そのユーザーに関する基本情報を取得することを可能にします。

source: OpenID Connect (OIDC) is an identity layer that works on top of the OAuth 2.0 protocol. OIDC enables client applications to verify the identity of a user based on the authentication performed by the OIDC provider and to retrieve basic information about that user.
ja_jp: OpenID Connect（OIDC）は、OAuth 2.0プロトコルの上で動作するIDレイヤーです。OIDCは、クライアントアプリケーションが、OIDCプロバイダーによって実行された認証に基づいてユーザーの身元を確認し、そのユーザーに関する基本的な情報を取得することを可能にします。

source: OpenID Connect Client and Filters
ja_jp: OpenID Connectクライアントとフィルター

source: OpenID Connect Client and Token Propagation Quickstart
ja_jp: OpenID Connect Client と Token Propagation のクイックスタート

source: OpenID Connect Providers
ja_jp: OpenID Connect プロバイダー

source: OpenID Connect Providers may be configured to require the `redirect_uri` parameter to have the same value (e.g. `http://localhost:8080/service/callback`) for all the redirect URLs. In such cases a `quarkus.oidc.authentication.redirect-path` property has to be set, for example, `quarkus.oidc.authentication.redirect-path=/service/callback`, and Quarkus will set the `redirect_uri` parameter to an absolute URL such as `http://localhost:8080/service/callback` which will be the same regardless of the current request URL.
ja_jp: OpenID Connect プロバイダーは、すべてのリダイレクト URL に対して同じ値 (例: `http://localhost:8080/service/callback`) を持つように `redirect_uri` パラメーターを要求するように設定できます。このような場合、 `quarkus.oidc.authentication.redirect-path` プロパティーが設定される必要があります (例: `quarkus.oidc.authentication.redirect-path=/service/callback`)。また、Quarkus は `redirect_uri` パラメータに `http://localhost:8080/service/callback` のような絶対 URL を設定します。これは現在のリクエスト URL に関係なく同じです。

source: OpenID Connect Providers may be configured to require the `redirect_uri` parameter to have the same value (eg. `http://localhost:8080/service/callback`) for all the redirect URLs. In such cases a `quarkus.oidc.authentication.redirect-path` property has to be set, for example, `quarkus.oidc.authentication.redirect-path=/service/callback`, and Quarkus will set the `redirect_uri` parameter to an absolute URL such as `http://localhost:8080/service/callback` which will be the same regardless of the current request URL.
ja_jp: OpenID Connect プロバイダは、 `redirect_uri` パラメータに同じ値（例. `http://localhost:8080/service/callback` など）を要求するように設定されている場合があります。 このような場合、 `quarkus.oidc.authentication.redirect-path` プロパティを設定する必要があります。たとえば、 `quarkus.oidc.authentication.redirect-path=/service/callback` を設定すると、Quarkusは `redirect_uri` パラメータを次のような絶対URLに設定します。 `http://localhost:8080/service/callback` これは、現在のリクエストURLに関係なく同じ値になります。

source: OpenID Connect and OAuth2 dynamic client registration allows you to register OIDC clients dynamically, and manage individual client registrations. You can read more about it in the https://openid.net/specs/openid-connect-registration-1_0.html[OIDC client registration] and https://datatracker.ietf.org/doc/html/rfc7592[OAuth2 Dynamic Client Registration Management Protocol] specification documents.
ja_jp: OpenID Connect と OAuth2 の動的クライアント登録を使用すると、OIDC クライアントを動的に登録し、個々のクライアント登録を管理できます。 詳細は、 https://openid.net/specs/openid-connect-registration-1_0.html[OIDC クライアント登録] および https://datatracker.ietf.org/doc/html/rfc7592[OAuth2 動的クライアント登録管理プロトコル] の仕様ドキュメントを参照してください。

source: OpenID Connect authentication
ja_jp: OpenID Connect 認証

source: OpenID Connect authorization code flow mechanism for protecting web applications
ja_jp: Web アプリケーションを保護するための OpenID Connect 認可コードフローメカニズム

source: OpenID Connect client and filters
ja_jp: OpenID Connect クライアントとフィルター

source: OpenID Connect client and token propagation quickstart
ja_jp: OpenID Connectクライアントとトークン伝搬クイックスタート

source: OpenSearch compatibility
ja_jp: OpenSearch対応

source: OpenShift Options
ja_jp: OpenShift オプション

source: OpenShift CLI (Optional, only required for manual deployment)
ja_jp: OpenShift CLI（オプション、手動デプロイ時のみ必要）

source: OpenShift Client
ja_jp: OpenShiftクライアント

source: OpenShift also provides the ability to use Knative by using the link:https://www.openshift.com/learn/topics/serverless[OpenShift Serverless] functionality.
ja_jp: OpenShiftでは、 link:https://www.openshift.com/learn/topics/serverless[OpenShift Serverless] の機能を利用することで、Knativeを利用することもできます。

source: OpenShift also provides the ability to use Knative via the link:https://www.openshift.com/learn/topics/serverless[OpenShift Serverless] functionality.
ja_jp: また、OpenShiftでは、OpenShift link:https://www.openshift.com/learn/topics/serverless[Serverless] 機能を介してKnativeを利用する機能も提供されています。

source: OpenShift automatically renews the serving certificates it generates. When the certificate is renewed, the secret is updated with the new certificate and private key.
ja_jp: OpenShift は生成した提供証明書を自動的に更新します。 証明書が更新されると、シークレットが新しい証明書と秘密鍵で更新されます。

source: OpenShift builds require creating a `BuildConfig` and two `ImageStream` resources, one for the builder image and one for the output image. The creation of such objects is being taken care of by the Quarkus Kubernetes extension.
ja_jp: OpenShiftのビルドでは、 `BuildConfig` 、ビルダーイメージ用と出力イメージ用の2つの `ImageStream` リソースを作成する必要があります。このようなオブジェクトの作成は、Quarkus Kubernetesエクステンションによって行われます。

source: OpenShift provides multiple ways of defining environment variables:
ja_jp: OpenShiftでは環境変数の定義方法が複数用意されています。

source: OpenShift users might want to use `oc` rather than `kubectl`:
ja_jp: OpenShift のユーザーは、 `kubectl`ではなく、 `oc` を使用することをお勧めします。

source: OpenShift's users might want to use `oc` rather than `kubectl`:
ja_jp: OpenShift のユーザーは、kubectl ではなく oc を使用したい場合があります。

source: OpenTelemetry Configuration Reference
ja_jp: OpenTelemetry 設定リファレンス
